Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc_ex.h
/**
  ******************************************************************************
  * @file    py32e407_hal_rcc_ex.h
  * @author  MCU Application Team
  * @brief   Header file of RCC HAL Extended module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32E407_HAL_RCC_EX_H
#define __PY32E407_HAL_RCC_EX_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32e407_hal_def.h"

/** @addtogroup PY32E407_HAL_Driver
  * @{
  */

/** @addtogroup RCCEx
  * @{
  */

/* Private Constants ---------------------------------------------------------*/
/** @addtogroup RCCEx_Private_Constants
 * @{
 */

/**
  * @}
  */

/* Private Macros ------------------------------------------------------------*/
/** @addtogroup RCCEx_Private_Macros
 * @{
 */

#define IS_RCC_PLL_MUL(__MUL__) (((__MUL__) >= 2U) && ((__MUL__) <= 257U))

#define IS_RCC_MCOSOURCE(__SOURCE__) (((__SOURCE__) == RCC_MCOSOURCE_NOCLOCK)  || ((__SOURCE__) == RCC_MCOSOURCE_LSE)    || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_LSI)      || ((__SOURCE__) == RCC_MCOSOURCE_HSI48M) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_SYSCLK)   || ((__SOURCE__) == RCC_MCOSOURCE_HSI16M) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HSE)      || ((__SOURCE__) == RCC_MCOSOURCE_PLLCLK) || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_HCLK)     || ((__SOURCE__) == RCC_MCOSOURCE_PCLK1)  || \
                                       ((__SOURCE__) == RCC_MCOSOURCE_PCLK2)    || ((__SOURCE__) == RCC_MCOSOURCE_HSI10M))

#define IS_RCC_ADCPLLCLK_DIV(__ADCCLK__) (((__ADCCLK__) == RCC_ADCPCLK2_DIV2)  || ((__ADCCLK__) == RCC_ADCPCLK2_DIV4)   || \
                                          ((__ADCCLK__) == RCC_ADCPCLK2_DIV6)  || ((__ADCCLK__) == RCC_ADCPCLK2_DIV8)   || \
                                          ((__ADCCLK__) == RCC_ADCPCLK2_DIV12) || ((__ADCCLK__) == RCC_ADCPCLK2_DIV16))

#define IS_RCC_USBCLKSOURCE(__USBCLK__)  (((__USBCLK__) == RCC_USBCLKSOURCE_PLL)      || ((__USBCLK__) == RCC_USBCLKSOURCE_PLL_DIV1_5)   || \
                                          ((__USBCLK__) == RCC_USBCLKSOURCE_PLL_DIV2) || ((__USBCLK__) == RCC_USBCLKSOURCE_PLL_DIV2_5)   || \
                                          ((__USBCLK__) == RCC_USBCLKSOURCE_PLL_DIV3) || ((__USBCLK__) == RCC_USBCLKSOURCE_PLL_DIV3_5)   || \
                                          ((__USBCLK__) == RCC_USBCLKSOURCE_PLL_DIV4) || ((__USBCLK__) == RCC_USBCLKSOURCE_HSI48M))

#define IS_RCC_SRAM2CLK_DIV(_SRAM2CLK__) (((_SRAM2CLK__) == RCC_SRAM2HCLK_DIV1)  || ((_SRAM2CLK__) == RCC_SRAM2HCLK_DIV2))





#define IS_RCC_CANCLKSOURCE(__CANCLK__)  (((__CANCLK__) == RCC_CANCLKSOURCE_PLL)      || ((__CANCLK__) == RCC_CANCLKSOURCE_PLL_DIV2)   || \
                                          ((__CANCLK__) == RCC_CANCLKSOURCE_PLL_DIV3) || ((__CANCLK__) == RCC_CANCLKSOURCE_PLL_DIV4)   || \
                                          ((__CANCLK__) == RCC_CANCLKSOURCE_PLL_DIV5) || ((__CANCLK__) == RCC_CANCLKSOURCE_PLL_DIV6)   || \
                                          ((__CANCLK__) == RCC_CANCLKSOURCE_PLL_DIV7) || ((__CANCLK__) == RCC_CANCLKSOURCE_PLL_DIV8)   || \
                                          ((__CANCLK__) == RCC_CANCLKSOURCE_HSE))

#define IS_RCC_PVDFILTERCLK(__PVDFILTERCLK__) (((__PVDFILTERCLK__) == RCC_PVDFILTERCLK_LSI)  || ((__PVDFILTERCLK__) == RCC_PVDFILTERCLK_LSE)  || \
                                               ((__PVDFILTERCLK__) == RCC_PVDFILTERCLK_PCLK1))

#define IS_RCC_USART1CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_USART1CLKSOURCE_PCLK2)  || ((__SOURCE__) == RCC_USART1CLKSOURCE_SYSCLK) || \
                                            ((__SOURCE__) == RCC_USART1CLKSOURCE_LSE)    || ((__SOURCE__) == RCC_USART1CLKSOURCE_HSI))

#define IS_RCC_USART2CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_USART2CLKSOURCE_PCLK1)  || ((__SOURCE__) == RCC_USART2CLKSOURCE_SYSCLK) || \
                                            ((__SOURCE__) == RCC_USART2CLKSOURCE_LSE)    || ((__SOURCE__) == RCC_USART2CLKSOURCE_HSI))

#define IS_RCC_USART3CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_USART3CLKSOURCE_PCLK1)  || ((__SOURCE__) == RCC_USART3CLKSOURCE_SYSCLK) || \
                                            ((__SOURCE__) == RCC_USART3CLKSOURCE_LSE)    || ((__SOURCE__) == RCC_USART3CLKSOURCE_HSI))

#define IS_RCC_LPUART1CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_LPUART1CLKSOURCE_PCLK1)  || ((__SOURCE__) == RCC_LPUART1CLKSOURCE_SYSCLK) || \
                                             ((__SOURCE__) == RCC_LPUART1CLKSOURCE_LSE)    || ((__SOURCE__) == RCC_LPUART1CLKSOURCE_HSI))

#define IS_RCC_LPTIM1CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_LPTIM1CLKSOURCE_PCLK1) || ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSI)   || \
                                            ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_HSI)   || ((__SOURCE__) == RCC_LPTIM1CLKSOURCE_LSE))

#define IS_RCC_COMP1CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_COMP1CLKSOURCE_PCLK2) || ((__SOURCE__) == RCC_COMP1CLKSOURCE_LSI)   || \
                                           ((__SOURCE__) == RCC_COMP1CLKSOURCE_LSE))

#define IS_RCC_COMP2CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_COMP2CLKSOURCE_PCLK2) || ((__SOURCE__) == RCC_COMP2CLKSOURCE_LSI)   || \
                                           ((__SOURCE__) == RCC_COMP2CLKSOURCE_LSE))

#define IS_RCC_COMP3CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_COMP3CLKSOURCE_PCLK2) || ((__SOURCE__) == RCC_COMP3CLKSOURCE_LSI)   || \
                                           ((__SOURCE__) == RCC_COMP3CLKSOURCE_LSE))

#define IS_RCC_COMP4CLKSOURCE(__SOURCE__) (((__SOURCE__) == RCC_COMP4CLKSOURCE_PCLK2) || ((__SOURCE__) == RCC_COMP4CLKSOURCE_LSI)   || \
                                           ((__SOURCE__) == RCC_COMP4CLKSOURCE_LSE))

