Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc_ex.h
#define IS_RCC_PERIPHCLOCK(PERIPHCLOCK)  ((PERIPHCLOCK) <= RCC_PERIPHCLK_MASK)

/**
  * @}
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup RCCEx_Exported_Types RCCEx Exported Types
  * @{
  */

/**
  * @brief  RCC extended clocks structure definition
  */
typedef struct
{
  uint32_t PeriphClockSelection;            /*!< The Extended Clock to be configured.
                                            This parameter can be a value of @ref RCCEx_Periph_Clock_Selection */

  uint32_t RtcClockSelection;              /*!< specifies the RTC clock source.
                                             This parameter can be a value of @ref RCC_RTC_Clock_Source */
  
  uint32_t AdcClockSelection;              /*!< ADC clock source
                                            This parameter can be a value of @ref RCCEx_ADC_Prescaler */

  uint32_t UsbClockSelection;              /*!< USB clock source
                                            This parameter can be a value of @ref RCCEx_USB_Prescaler */

  uint32_t Sram2ClockSelection;            /*!< SRAM2 clock source
                                            This parameter can be a value of @ref RCCEx_SRAM2_Prescaler */

  uint32_t CanClockSelection;              /*!< CAN clock source
                                            This parameter can be a value of @ref RCCEx_CAN_Clock_Source */
  
  uint32_t PvdFilterClockSelection;        /*!< PVD filter clock source
                                            This parameter can be a value of @ref RCCEx_PVD_Filter_Clock_Source */
  
  uint32_t Usart1ClockSelection;           /*!< Specifies USART1 clock source.
                                            This parameter can be a value of @ref RCCEx_USART1_Clock_Source */

  uint32_t Usart2ClockSelection;           /*!< Specifies USART2 clock source.
                                            This parameter can be a value of @ref RCCEx_USART2_Clock_Source */

  uint32_t Usart3ClockSelection;           /*!< Specifies USART3 clock source.
                                            This parameter can be a value of @ref RCCEx_USART3_Clock_Source */

  uint32_t Lpuart1ClockSelection;          /*!< Specifies LPUART1 clock source.
                                            This parameter can be a value of @ref RCCEx_LPUART1_Clock_Source */

  uint32_t Lptim1ClockSelection;           /*!< Specifies LPTIM1 clock source.
                                            This parameter can be a value of @ref RCCEx_LPTIM1_Clock_Source */
  
  uint32_t Comp1ClockSelection;            /*!< Specifies COMP1 clock source.
                                            This parameter can be a value of @ref RCCEx_COMP1_Clock_Source */
  
  uint32_t Comp2ClockSelection;            /*!< Specifies COMP2 clock source.
                                            This parameter can be a value of @ref RCCEx_COMP2_Clock_Source */
  
  uint32_t Comp3ClockSelection;            /*!< Specifies COMP3 clock source.
                                            This parameter can be a value of @ref RCCEx_COMP3_Clock_Source */
  
  uint32_t Comp4ClockSelection;            /*!< Specifies COMP4 clock source.
                                            This parameter can be a value of @ref RCCEx_COMP4_Clock_Source */
  
} RCC_PeriphCLKInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RCCEx_Exported_Constants RCCEx Exported Constants
  * @{
  */

/** @defgroup RCCEx_Periph_Clock_Selection Periph Clock Selection
  * @{
  */
#define RCC_PERIPHCLK_RTC           0x00000001U
#define RCC_PERIPHCLK_ADC           0x00000002U
#define RCC_PERIPHCLK_USB           0x00000004U
#define RCC_PERIPHCLK_SRAM2         0x00000008U
#define RCC_PERIPHCLK_CAN           0x00000010U
#define RCC_PERIPHCLK_PVD           0x00000020U
#define RCC_PERIPHCLK_USART1        0x00000040U
#define RCC_PERIPHCLK_USART2        0x00000080U
#define RCC_PERIPHCLK_USART3        0x00000100U
#define RCC_PERIPHCLK_LPUART1       0x00000200U
#define RCC_PERIPHCLK_LPTIM1        0x00000400U
#define RCC_PERIPHCLK_COMP1         0x00000800U
#define RCC_PERIPHCLK_COMP2         0x00001000U
#define RCC_PERIPHCLK_COMP3         0x00002000U
#define RCC_PERIPHCLK_COMP4         0x00004000U

#define RCC_PERIPHCLK_MASK          0x00007FFFU
/**
  * @}
  */

/** @defgroup RCCEx_ADC_Prescaler ADC Prescaler
  * @{
  */
#define RCC_ADCPCLK2_DIV2              RCC_CFGR_ADCPRE_DIV2
#define RCC_ADCPCLK2_DIV4              RCC_CFGR_ADCPRE_DIV4
#define RCC_ADCPCLK2_DIV6              RCC_CFGR_ADCPRE_DIV6
#define RCC_ADCPCLK2_DIV8              RCC_CFGR_ADCPRE_DIV8
#define RCC_ADCPCLK2_DIV12             RCC_CFGR_ADCPRE_DIV12
#define RCC_ADCPCLK2_DIV16             RCC_CFGR_ADCPRE_DIV16
/**
  * @}
  */

/** @defgroup RCCEx_USB_Prescaler USB Clock Source
  * @{
  */
#define RCC_USBCLKSOURCE_PLL              RCC_CFGR_USBPRE_0
#define RCC_USBCLKSOURCE_PLL_DIV1_5       0x00000000U
#define RCC_USBCLKSOURCE_PLL_DIV2         (RCC_CFGR_USBPRE_1 | RCC_CFGR_USBPRE_0)
#define RCC_USBCLKSOURCE_PLL_DIV2_5       (RCC_CFGR_USBPRE_1)
#define RCC_USBCLKSOURCE_PLL_DIV3         (RCC_CFGR_USBPRE_2)
#define RCC_USBCLKSOURCE_PLL_DIV3_5       (RCC_CFGR_USBPRE_2 | RCC_CFGR_USBPRE_0)
#define RCC_USBCLKSOURCE_PLL_DIV4         (RCC_CFGR_USBPRE_2 | RCC_CFGR_USBPRE_1)
#define RCC_USBCLKSOURCE_HSI48M           RCC_CFGR1_USBSELHSI48
/**
  * @}
  */

/** @defgroup RCCEx_SRAM2_Prescaler SRAM2 Prescaler
  * @{
  */
#define RCC_SRAM2HCLK_DIV1              0x00000000
#define RCC_SRAM2HCLK_DIV2              RCC_CFGR_SRAM2PRE
/**
  * @}
  */

/** @defgroup RCCEx_CAN_Clock_Source CAN Clock Source
  * @{
  */
#define RCC_CANCLKSOURCE_PLL           0x00000000U
#define RCC_CANCLKSOURCE_PLL_DIV2      RCC_CFGR2_CANCKSEL_0
#define RCC_CANCLKSOURCE_PLL_DIV3      RCC_CFGR2_CANCKSEL_1
#define RCC_CANCLKSOURCE_PLL_DIV4      (RCC_CFGR2_CANCKSEL_1 | RCC_CFGR2_CANCKSEL_0)
#define RCC_CANCLKSOURCE_PLL_DIV5      RCC_CFGR2_CANCKSEL_2
#define RCC_CANCLKSOURCE_PLL_DIV6      (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_0)
#define RCC_CANCLKSOURCE_PLL_DIV7      (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_1)
#define RCC_CANCLKSOURCE_PLL_DIV8      (RCC_CFGR2_CANCKSEL_2 | RCC_CFGR2_CANCKSEL_1 | RCC_CFGR2_CANCKSEL_0)
#define RCC_CANCLKSOURCE_HSE           RCC_CFGR2_CANCKSEL_3
/**
  * @}
  */

/** @defgroup RCCEx_PVD_Filter_Clock_Source PVD Filter Clock Source
  * @{
  */
#define RCC_PVDFILTERCLK_LSI            0x00000000
#define RCC_PVDFILTERCLK_LSE            RCC_CFGR1_PVDSEL_0
#define RCC_PVDFILTERCLK_PCLK1          RCC_CFGR1_PVDSEL_1
/**
  * @}
  */

/** @defgroup RCCEx_USART1_Clock_Source USART1 Clock Source
  * @{
  */
#define RCC_USART1CLKSOURCE_PCLK2      0x00000000U
#define RCC_USART1CLKSOURCE_SYSCLK     RCC_CCIPR_USART1SEL_0
#define RCC_USART1CLKSOURCE_HSI        RCC_CCIPR_USART1SEL_1
#define RCC_USART1CLKSOURCE_LSE        (RCC_CCIPR_USART1SEL_0 | RCC_CCIPR_USART1SEL_1)
/**
  * @}
  */

