Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc_ex.h
/** @defgroup RCCEx_USART2_Clock_Source USART2 Clock Source
  * @{
  */
#define RCC_USART2CLKSOURCE_PCLK1      0x00000000U
#define RCC_USART2CLKSOURCE_SYSCLK     RCC_CCIPR_USART2SEL_0
#define RCC_USART2CLKSOURCE_HSI        RCC_CCIPR_USART2SEL_1
#define RCC_USART2CLKSOURCE_LSE        (RCC_CCIPR_USART2SEL_0 | RCC_CCIPR_USART2SEL_1)
/**
  * @}
  */

/** @defgroup RCCEx_USART3_Clock_Source USART3 Clock Source
  * @{
  */
#define RCC_USART3CLKSOURCE_PCLK1      0x00000000U
#define RCC_USART3CLKSOURCE_SYSCLK     RCC_CCIPR_USART3SEL_0
#define RCC_USART3CLKSOURCE_HSI        RCC_CCIPR_USART3SEL_1
#define RCC_USART3CLKSOURCE_LSE        (RCC_CCIPR_USART3SEL_0 | RCC_CCIPR_USART3SEL_1)
/**
  * @}
  */

/** @defgroup RCCEx_LPUART1_Clock_Source LPUART1 Clock Source
  * @{
  */
#define RCC_LPUART1CLKSOURCE_PCLK1     0x00000000U
#define RCC_LPUART1CLKSOURCE_SYSCLK    RCC_CCIPR_LPUART1SEL_0
#define RCC_LPUART1CLKSOURCE_HSI       RCC_CCIPR_LPUART1SEL_1
#define RCC_LPUART1CLKSOURCE_LSE       (RCC_CCIPR_LPUART1SEL_0 | RCC_CCIPR_LPUART1SEL_1)
/**
  * @}
  */

/** @defgroup RCCEx_LPTIM1_Clock_Source LPTIM1 Clock Source
  * @{
  */
#define RCC_LPTIM1CLKSOURCE_PCLK1      0x00000000U
#define RCC_LPTIM1CLKSOURCE_LSI        RCC_CCIPR_LPTIM1SEL_0
#define RCC_LPTIM1CLKSOURCE_HSI        RCC_CCIPR_LPTIM1SEL_1
#define RCC_LPTIM1CLKSOURCE_LSE        RCC_CCIPR_LPTIM1SEL
/**
  * @}
  */

/** @defgroup RCCEx_COMP1_Clock_Source COMP1 Clock Source
  * @{
  */
#define RCC_COMP1CLKSOURCE_PCLK2      0x00000000U
#define RCC_COMP1CLKSOURCE_LSI        RCC_CCIPR_COMP1SEL_0
#define RCC_COMP1CLKSOURCE_LSE        RCC_CCIPR_COMP1SEL_1
/**
  * @}
  */

/** @defgroup RCCEx_COMP2_Clock_Source COMP2 Clock Source
  * @{
  */
#define RCC_COMP2CLKSOURCE_PCLK2      0x00000000U
#define RCC_COMP2CLKSOURCE_LSI        RCC_CCIPR_COMP2SEL_0
#define RCC_COMP2CLKSOURCE_LSE        RCC_CCIPR_COMP2SEL_1
/**
  * @}
  */

/** @defgroup RCCEx_COMP3_Clock_Source COMP3 Clock Source
  * @{
  */
#define RCC_COMP3CLKSOURCE_PCLK2      0x00000000U
#define RCC_COMP3CLKSOURCE_LSI        RCC_CCIPR_COMP3SEL_0
#define RCC_COMP3CLKSOURCE_LSE        RCC_CCIPR_COMP3SEL_1
/**
  * @}
  */

/** @defgroup RCCEx_COMP4_Clock_Source COMP4 Clock Source
  * @{
  */
#define RCC_COMP4CLKSOURCE_PCLK2      0x00000000U
#define RCC_COMP4CLKSOURCE_LSI        RCC_CCIPR_COMP4SEL_0
#define RCC_COMP4CLKSOURCE_LSE        RCC_CCIPR_COMP4SEL_1
/**
  * @}
  */

/** @defgroup RCCEx_Prediv1_Factor HSE Prediv1 Factor
  * @{
  */

#define RCC_HSE_PREDIV_DIV1              0x00000000U
#define RCC_HSE_PREDIV_DIV2              RCC_CFGR3_PLLXTPRE

/**
  * @}
  */

/** @defgroup RCCEx_PLL_Prediv_Factor PLL Prediv Factor
  * @{
  */
#define RCC_PLL_PREDIV_DIV1             RCC_CFGR3_PLLPREDIV1
#define RCC_PLL_PREDIV_DIV2             RCC_CFGR3_PLLPREDIV2
#define RCC_PLL_PREDIV_DIV4             RCC_CFGR3_PLLPREDIV4
#define RCC_PLL_PREDIV_DIV8             RCC_CFGR3_PLLPREDIV8
/**
  * @}
  */

/** @defgroup RCCEx_PLL_Postdiv_Factor PLL Postdiv Factor
  * @{
  */
#define RCC_PLL_POSTDIV_DIV1            RCC_CFGR3_PLLPOSTDIV1
#define RCC_PLL_POSTDIV_DIV2            RCC_CFGR3_PLLPOSTDIV2
#define RCC_PLL_POSTDIV_DIV4            RCC_CFGR3_PLLPOSTDIV4
#define RCC_PLL_POSTDIV_DIV8            RCC_CFGR3_PLLPOSTDIV8
/**
  * @}
  */

/** @defgroup RCC_MCO_Index MCO Index
  * @{
  */
#define RCC_MCO1                       0x00000000U
#define RCC_MCO                        RCC_MCO1               /*!< MCO1 to be compliant with other families with 2 MCOs*/
#define RCC_MCO2                       0x00000001U

/**
  * @}
  */

/** @defgroup RCCEx_MCO1_Clock_Source MCO1 Clock Source
  * @{
  */
#define RCC_MCOSOURCE_NOCLOCK           ((uint32_t)RCC_CFGR_MCO_NOCLOCK)
#define RCC_MCOSOURCE_SYSCLK            ((uint32_t)RCC_CFGR_MCO_SYSCLK)
#define RCC_MCOSOURCE_HSI16M            ((uint32_t)RCC_CFGR_MCO_HSI16M)
#define RCC_MCOSOURCE_LSI               ((uint32_t)RCC_CFGR_MCO_LSI)
#define RCC_MCOSOURCE_HSE               ((uint32_t)RCC_CFGR_MCO_HSE)
#define RCC_MCOSOURCE_LSE               ((uint32_t)RCC_CFGR_MCO_LSE)
#define RCC_MCOSOURCE_PLLCLK            ((uint32_t)RCC_CFGR_MCO_PLL)
#define RCC_MCOSOURCE_HSI48M            ((uint32_t)RCC_CFGR_MCO_HSI48M)
#define RCC_MCOSOURCE_HCLK              ((uint32_t)RCC_CFGR_MCO_HCLK)
#define RCC_MCOSOURCE_PCLK1             ((uint32_t)RCC_CFGR_MCO_PCLK1)
#define RCC_MCOSOURCE_PCLK2             ((uint32_t)RCC_CFGR_MCO_PCLK2)
#define RCC_MCOSOURCE_HSI10M            ((uint32_t)RCC_CFGR_MCO_HSI10M)
/**
  * @}
  */

/**
  * @}
  */

/** @defgroup RCCEx_HSE_Configuration HSE Configuration
  * @{
  */

/**
  * @brief  Macro to configure the External High Speed oscillator (HSE) Predivision factor for PLL.
  * @note   Predivision factor can not be changed if PLL is used as system clock
  *         In this case, you have to select another source of the system clock, disable the PLL and
  *         then change the HSE predivision factor.
  * @param  __HSE_PREDIV_VALUE__ specifies the division value applied to HSE.
  *         This parameter must be a number between RCC_HSE_PREDIV_DIV1 and RCC_HSE_PREDIV_DIV2.
  */
#define __HAL_RCC_HSE_PREDIV_CONFIG(__HSE_PREDIV_VALUE__) \
                  MODIFY_REG(RCC->CFGR3,RCC_CFGR3_PLLXTPRE, (uint32_t)(__HSE_PREDIV_VALUE__))

/**
  * @brief  Macro to get prediv1 factor for PLL.
  */
#define __HAL_RCC_HSE_GET_PREDIV() READ_BIT(RCC->CFGR3, RCC_CFGR3_PLLXTPRE)


/**
  * @}
  */

/** @defgroup RCCEx_Peripheral_Configuration Peripheral Configuration
  * @brief  Macros to configure clock source of different peripherals.
  * @{
  */

/** @brief  Macro to configure the ADCx clock (x=1 to 3 depending on devices).
  * @param  __ADCCLKSOURCE__ specifies the ADC clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_ADCPCLK2_DIV2  PCLK2 clock divided by 2  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV4  PCLK2 clock divided by 4  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV6  PCLK2 clock divided by 6  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV8  PCLK2 clock divided by 8  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV12 PCLK2 clock divided by 12 selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV16 PCLK2 clock divided by 16 selected as ADC clock
  */
#define __HAL_RCC_ADC_CONFIG(__ADCCLKSOURCE__) \
                  MODIFY_REG(RCC->CFGR, RCC_CFGR_ADCPRE, (uint32_t)(__ADCCLKSOURCE__))

