Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc_ex.h
/** @brief  Macro to get the ADC clock (ADCxCLK, x=1 to 3 depending on devices).
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_ADCPCLK2_DIV2  PCLK2 clock divided by 2  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV4  PCLK2 clock divided by 4  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV6  PCLK2 clock divided by 6  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV8  PCLK2 clock divided by 8  selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV12 PCLK2 clock divided by 12 selected as ADC clock
  *            @arg @ref RCC_ADCPCLK2_DIV16 PCLK2 clock divided by 16 selected as ADC clock
  */
#define __HAL_RCC_GET_ADC_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_ADCPRE)))

/** @brief  Macro to configure the USB clock.
  * @param  __USBCLKSOURCE__ specifies the USB clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_USBCLKSOURCE_PLL PLL clock divided by 1 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV1_5 PLL clock divided by 1.5 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV2   PLL clock divided by 2 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV2_5 PLL clock divided by 2.5 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV3   PLL clock divided by 3 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV3_5 PLL clock divided by 3.5 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV4   PLL clock divided by 4 selected as USB clock
*/
#define __HAL_RCC_USB_CONFIG(__USBCLKSOURCE__) \
                  MODIFY_REG(RCC->CFGR, RCC_CFGR_USBPRE, (uint32_t)(__USBCLKSOURCE__))

/** @brief  Macro to get the USB clock.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_USBCLKSOURCE_PLL PLL clock divided by 1 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV1_5 PLL clock divided by 1.5 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV2   PLL clock divided by 2 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV2_5 PLL clock divided by 2.5 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV3   PLL clock divided by 3 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV3_5 PLL clock divided by 3.5 selected as USB clock
  *            @arg @ref RCC_USBCLKSOURCE_PLL_DIV4   PLL clock divided by 4 selected as USB clock
  */
#define __HAL_RCC_GET_USB_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_USBPRE)))

/** @brief  Macro to configure the SRAM2 clock.
  * @param  __SRAM2CLKSOURCE__ specifies the SRAM2 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_SRAM2HCLK_DIV1  HCLK clock divided by 1  selected as SRAM2 clock
  *            @arg @ref RCC_SRAM2HCLK_DIV2  HCLK clock divided by 2  selected as SRAM2 clock
  */
#define __HAL_RCC_SRAM2_CONFIG(__SRAM2CLKSOURCE__) \
                  MODIFY_REG(RCC->CFGR, RCC_CFGR_SRAM2PRE, (uint32_t)(__SRAM2CLKSOURCE__))

/** @brief  Macro to get the SRAM2 clock.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_SRAM2HCLK_DIV1  HCLK clock divided by 1  selected as SRAM2 clock
  *            @arg @ref RCC_SRAM2HCLK_DIV2  HCLK clock divided by 2  selected as SRAM2 clock
  */
#define __HAL_RCC_GET_SRAM2_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_SRAM2PRE)))

/** @brief  Macro to configure the CAN clock.
  * @param  __CANCLKSOURCE__ specifies the CAN clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_CANCLKSOURCE_PLL      PLL clock divided by 1 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV2 PLL clock divided by 2 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV3 PLL clock divided by 3 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV4 PLL clock divided by 4 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV5 PLL clock divided by 5 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV6 PLL clock divided by 6 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV7 PLL clock divided by 7 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV8 PLL clock divided by 8 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_HSE      HSE selected as CAN clock
*/
#define __HAL_RCC_CAN_CONFIG(__CANCLKSOURCE__) \
                  MODIFY_REG(RCC->CFGR2, RCC_CFGR2_CANCKSEL, (uint32_t)(__CANCLKSOURCE__))

/** @brief  Macro to get the CAN clock.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_CANCLKSOURCE_PLL      PLL clock divided by 1 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV2 PLL clock divided by 2 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV3 PLL clock divided by 3 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV4 PLL clock divided by 4 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV5 PLL clock divided by 5 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV6 PLL clock divided by 6 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV7 PLL clock divided by 7 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_PLL_DIV8 PLL clock divided by 8 selected as CAN clock
  *            @arg @ref RCC_CANCLKSOURCE_HSE      HSE selected as CAN clock
  */
#define __HAL_RCC_GET_CAN_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR2, RCC_CFGR2_CANCKSEL)))

/** @brief  Macro to configure the PVD filter clock.
  * @param  __PVDFILTERCLK__ specifies the SRAM2 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_PVDFILTERCLK_LSI  LSI oscillator clock used as PVD filter clock
  *            @arg @ref RCC_PVDFILTERCLK_LSE  LSE oscillator clock used as PVD filter clock
  *            @arg @ref RCC_PVDFILTERCLK_PCLK1 PCLK  used as PVD filter clock
  */
#define __HAL_RCC_PVD_CONFIG(__PVDFILTERCLK__) \
                  MODIFY_REG(RCC->CFGR1, RCC_CFGR1_PVDSEL, (uint32_t)(__PVDFILTERCLK__))

