Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_hal_rcc_ex.h
/** @brief  Macro to configure the COMP1 clock (COMP1CLK).
  *
  * @param  __COMP1_CLKSOURCE__ specifies the COMP1 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_COMP1CLKSOURCE_PCLK2  PCLK1 selected as COMP1 clock
  *            @arg @ref RCC_COMP1CLKSOURCE_LSI    HSI selected as COMP1 clock
  *            @arg @ref RCC_COMP1CLKSOURCE_LSE    LSE selected as COMP1 clock
  * @retval None
  */
#define __HAL_RCC_COMP1_CONFIG(__COMP1_CLKSOURCE__) \
                  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP1SEL, (__COMP1_CLKSOURCE__))

/** @brief  Macro to get the COMP1 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_COMP1CLKSOURCE_PCLK2  PCLK1 selected as COMP1 clock
  *            @arg @ref RCC_COMP1CLKSOURCE_LSI    HSI selected as COMP1 clock
  *            @arg @ref RCC_COMP1CLKSOURCE_LSE    LSE selected as COMP1 clock
  */
#define __HAL_RCC_GET_COMP1_SOURCE() (READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP1SEL))

/** @brief  Macro to configure the COMP1 clock (COMP1CLK).
  *
  * @param  __COMP2_CLKSOURCE__ specifies the COMP2 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_COMP2CLKSOURCE_PCLK2  PCLK1 selected as COMP2 clock
  *            @arg @ref RCC_COMP2CLKSOURCE_LSI    HSI selected as COMP2 clock
  *            @arg @ref RCC_COMP2CLKSOURCE_LSE    LSE selected as COMP2 clock
  * @retval None
  */
#define __HAL_RCC_COMP2_CONFIG(__COMP2_CLKSOURCE__) \
                  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP2SEL, (__COMP2_CLKSOURCE__))

/** @brief  Macro to get the COMP2 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_COMP2CLKSOURCE_PCLK2  PCLK1 selected as COMP2 clock
  *            @arg @ref RCC_COMP2CLKSOURCE_LSI    HSI selected as COMP2 clock
  *            @arg @ref RCC_COMP2CLKSOURCE_LSE    LSE selected as COMP2 clock
  */
#define __HAL_RCC_GET_COMP2_SOURCE() (READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP2SEL))

/** @brief  Macro to configure the COMP3 clock (COMP3CLK).
  *
  * @param  __COMP3_CLKSOURCE__ specifies the COMP3 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_COMP3CLKSOURCE_PCLK2  PCLK1 selected as COMP3 clock
  *            @arg @ref RCC_COMP3CLKSOURCE_LSI    HSI selected as COMP3 clock
  *            @arg @ref RCC_COMP3CLKSOURCE_LSE    LSE selected as COMP3 clock
  * @retval None
  */
#define __HAL_RCC_COMP3_CONFIG(__COMP3_CLKSOURCE__) \
                  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP3SEL, (__COMP3_CLKSOURCE__))

/** @brief  Macro to get the COMP3 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_COMP3CLKSOURCE_PCLK2  PCLK1 selected as COMP3 clock
  *            @arg @ref RCC_COMP3CLKSOURCE_LSI    HSI selected as COMP3 clock
  *            @arg @ref RCC_COMP3CLKSOURCE_LSE    LSE selected as COMP3 clock
  */
#define __HAL_RCC_GET_COMP3_SOURCE() (READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP3SEL))

/** @brief  Macro to configure the COMP4 clock (COMP4CLK).
  *
  * @param  __COMP4_CLKSOURCE__ specifies the COMP4 clock source.
  *          This parameter can be one of the following values:
  *            @arg @ref RCC_COMP4CLKSOURCE_PCLK2  PCLK1 selected as COMP4 clock
  *            @arg @ref RCC_COMP4CLKSOURCE_LSI    HSI selected as COMP4 clock
  *            @arg @ref RCC_COMP4CLKSOURCE_LSE    LSE selected as COMP4 clock
  * @retval None
  */
#define __HAL_RCC_COMP4_CONFIG(__COMP4_CLKSOURCE__) \
                  MODIFY_REG(RCC->CCIPR, RCC_CCIPR_COMP4SEL, (__COMP4_CLKSOURCE__))

/** @brief  Macro to get the COMP4 clock source.
  * @retval The clock source can be one of the following values:
  *            @arg @ref RCC_COMP4CLKSOURCE_PCLK2  PCLK1 selected as COMP4 clock
  *            @arg @ref RCC_COMP4CLKSOURCE_LSI    HSI selected as COMP4 clock
  *            @arg @ref RCC_COMP4CLKSOURCE_LSE    LSE selected as COMP4 clock
  */
#define __HAL_RCC_GET_COMP4_SOURCE() (READ_BIT(RCC->CCIPR, RCC_CCIPR_COMP4SEL))

/**
  * @}
  */

/**
  * @}
  */

/* Exported functions --------------------------------------------------------*/
/** @addtogroup RCCEx_Exported_Functions
  * @{
  */

/** @addtogroup RCCEx_Exported_Functions_Group1
  * @{
  */

HAL_StatusTypeDef HAL_RCCEx_PeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *PeriphClkInit);
void              HAL_RCCEx_GetPeriphCLKConfig(RCC_PeriphCLKInitTypeDef  *PeriphClkInit);
uint32_t          HAL_RCCEx_GetPeriphCLKFreq(uint32_t PeriphClk);

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __PY32E407_HAL_RCC_EX_H */


/************************ (C) COPYRIGHT Puya *****END OF FILE******************/

